# ConvertTrianglesToQuads Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FacetingUtils..::..ConvertTrianglesToQuads Method
FacetingUtils Class See Also
---
Replaces pairs of adjacent, coplanar triangles by quadrilaterals.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static IList<TriOrQuadFacet> ConvertTrianglesToQuads(
	TriangulationInterface triangulation
)
```

Visual Basic
---
```text
Public Shared Function ConvertTrianglesToQuads ( _
	triangulation As TriangulationInterface _
) As IList(Of TriOrQuadFacet)
```

Visual C++
---
```text
public:
static IList<TriOrQuadFacet^>^ ConvertTrianglesToQuads(
	TriangulationInterface^ triangulation
)
```

# ### Parameters
triangulation
    Type: Autodesk.Revit.DB..::..TriangulationInterface A triangulated face, shell, or solid.
# ### Return Value
A collection of triangles and quadrilaterals representing the original triangulated object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation failed. |

# See Also
FacetingUtils Class
Autodesk.Revit.DB Namespace